app/Controllers/Api/BookController.php

    public function listBook()
    {
        $emp = new BookModel();

        //log_message('error', $e->getMessage());

        $response = [
            'status' => 200,
            "error" => false,
            'messages' => 'Book list',
            'data' => $emp->findAll()
---
SELECT *
FROM `books`

    public function showBook($id_book)
    {
        $emp = new BookModel();

        $data = $emp->find($id_book);
---
SELECT *
FROM `books`
WHERE `books`.`id_book` = '3'